In [1]:
import pandas as pd

In [3]:
df_stds=pd.read_excel("C:\Manjunath\Personal\Manju\Pandas\Python\MLtest\ML_Test_Results.xlsx",sheet_name="Sheet1")

In [6]:
df_stds.head()

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
0,Test Code,NaN,NaN,987,231,231,987,645,987,231,645
1,Python,Q01,Arithmetic,2,2,2,2,2,2,0,2
2,Python,Q02,Strings,-,0,2,-,2,-,0,0
3,Python,Q03,Strings,2,0,2,2,-,2,2,-
4,Python,Q04,"Lists, Strings",-,4,4,-,-,-,4,-

In [10]:
df_stds.columns

Index(['Name', 'Unnamed: 1', 'Unnamed: 2', 'ST1', 'ST2', 'ST3', 'ST4', 'ST5',
       'ST6', 'ST7', 'ST8'],
      dtype='object')

In [12]:
df_stds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 11 columns):
Name          28 non-null object
Unnamed: 1    27 non-null object
Unnamed: 2    27 non-null object
ST1           28 non-null object
ST2           28 non-null object
ST3           28 non-null object
ST4           28 non-null object
ST5           28 non-null object
ST6           28 non-null object
ST7           28 non-null object
ST8           28 non-null object
dtypes: object(11)
memory usage: 2.5+ KB

In [20]:
df1=df_stds[1:]

In [21]:
df1.head()

     Name Unnamed: 1      Unnamed: 2 ST1 ST2 ST3 ST4 ST5 ST6 ST7 ST8
1  Python        Q01      Arithmetic   2   2   2   2   2   2   0   2
2  Python        Q02         Strings   -   0   2   -   2   -   0   0
3  Python        Q03         Strings   2   0   2   2   -   2   2   -
4  Python        Q04  Lists, Strings   -   4   4   -   -   -   4   -
5  Python        Q05         Strings   2   2   2   0   2   0   2   2

In [26]:
df2= df1.replace('-','0')

In [28]:
df2.head()

     Name Unnamed: 1      Unnamed: 2 ST1 ST2 ST3 ST4 ST5 ST6 ST7 ST8
1  Python        Q01      Arithmetic   2   2   2   2   2   2   0   2
2  Python        Q02         Strings   0   0   2   0   2   0   0   0
3  Python        Q03         Strings   2   0   2   2   0   2   2   0
4  Python        Q04  Lists, Strings   0   4   4   0   0   0   4   0
5  Python        Q05         Strings   2   2   2   0   2   0   2   2

In [47]:
columns=df2.columns.tolist()
columns

['Name',
 'Unnamed: 1',
 'Unnamed: 2',
 'ST1',
 'ST2',
 'ST3',
 'ST4',
 'ST5',
 'ST6',
 'ST7',
 'ST8']

In [59]:
df2[['ST1', 'ST2', 'ST3', 'ST4', 'ST5', 'ST6', 'ST7', 'ST8']] = df2[['ST1', 'ST2', 'ST3', 'ST4', 'ST5', 'ST6', 'ST7', 'ST8']].apply(pd.to_numeric)

In [60]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 1 to 27
Data columns (total 11 columns):
Name          27 non-null object
Unnamed: 1    27 non-null object
Unnamed: 2    27 non-null object
ST1           27 non-null int64
ST2           27 non-null int64
ST3           27 non-null int64
ST4           27 non-null int64
ST5           27 non-null int64
ST6           27 non-null int64
ST7           27 non-null int64
ST8           27 non-null int64
dtypes: int64(8), object(3)
memory usage: 2.4+ KB

In [186]:
Group_Name=df2.groupby('Name')

In [187]:
for Name,Namedf in Group_Name:
    print (Name)
    print (Namedf)

Lin Algebra
           Name Unnamed: 1     Unnamed: 2  ST1  ST2  ST3  ST4  ST5  ST6  ST7  \
24  Lin Algebra        LS1            Age    0    0    2    0    0    2    2
25  Lin Algebra        LS2  Sim Equations    0    0    2    0    2    0    2
26  Lin Algebra        LS3  Sim Equations    0    0    4    4    4    0    4
27  Lin Algebra        LS4            Age    0    0    0    2    0    2    0

    ST8
24    0
25    2
26    4
27    0
Probability
           Name Unnamed: 1    Unnamed: 2  ST1  ST2  ST3  ST4  ST5  ST6  ST7  \
20  Probability        PS1        Height    0    0    2    2    0    2    2
21  Probability        PS2       Bowlers    0    2    2    0    2    0    2
22  Probability        PS3  Last 2 sixes    0    0    0    0    2    0    0
23  Probability        PS4     10 to win    4    0    0    0    0    4    0

    ST8
20    0
21    2
22    2
23    4
Python
      Name Unnamed: 1      Unnamed: 2  ST1  ST2  ST3  ST4  ST5  ST6  ST7  ST8
1   Python        Q01      Arithmetic    2    2    2    2    2    2    0    2
2   Python        Q02         Strings    0    0    2    0    2    0    0    0
3   Python        Q03         Strings    2    0    2    2    0    2    2    0
4   Python        Q04  Lists, Strings    0    4    4    0    0    0    4    0
5   Python        Q05         Strings    2    2    2    0    2    0    2    2
6   Python        Q06   Comprehension    0    4    4    4    4    2    0    4
7   Python        Q07  Lists, Strings    0    0    0    0    0    0    0    0
8   Python        Q08         Strings    2    0    0    2    2    0    0    2
9   Python        Q09         Modules    2    0    0    2    2    2    2    2
10  Python        Q10           Lists    2    2    2    2    0    0    2    0
11  Python        Q11           Loops    2    0    2    2    2    2    2    0
12  Python        Q12           Loops    2    2    2    2    0    2    2    0
13  Python        Q13           Loops    0    0    0    0    4    0    0    0
14  Python        Q14           Loops    2    0    0    2    2    2    0    0
15  Python        Q15           Loops    0    0    2    0    2    0    2    0
Statistics
          Name Unnamed: 1    Unnamed: 2  ST1  ST2  ST3  ST4  ST5  ST6  ST7  \
16  Statistics        QS1          Mode    2    0    2    0    0    2    2
17  Statistics        QS2        Median    0    2    2    0    0    0    2
18  Statistics        QS3  Mode, Median    4    0    4    4    4    4    4
19  Statistics        QS4          Mode    2    0    0    2    2    0    0

    ST8
16    0
17    2
18    4
19    2

In [188]:
df_linear=Group_Name.get_group('Lin Algebra')

In [189]:
df_linear

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
24,Lin Algebra,LS1,Age,0,0,2,0,0,2,2,0
25,Lin Algebra,LS2,Sim Equations,0,0,2,0,2,0,2,2
26,Lin Algebra,LS3,Sim Equations,0,0,4,4,4,0,4,4
27,Lin Algebra,LS4,Age,0,0,0,2,0,2,0,0

In [190]:
listLinear=df_linear.sum()
listLinear[3:]

ST1    0
ST2    0
ST3    8
ST4    6
ST5    6
ST6    4
ST7    8
ST8    6
dtype: object

In [191]:
df_Stat=Group_Name.get_group('Statistics')
df_Stat

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
16,Statistics,QS1,Mode,2,0,2,0,0,2,2,0
17,Statistics,QS2,Median,0,2,2,0,0,0,2,2
18,Statistics,QS3,"Mode, Median",4,0,4,4,4,4,4,4
19,Statistics,QS4,Mode,2,0,0,2,2,0,0,2

In [192]:
listStat=df_Stat.sum()
listStat[3:]

ST1    8
ST2    2
ST3    8
ST4    6
ST5    6
ST6    6
ST7    8
ST8    8
dtype: object

In [193]:
df_Prob=Group_Name.get_group('Probability')
df_Prob

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
20,Probability,PS1,Height,0,0,2,2,0,2,2,0
21,Probability,PS2,Bowlers,0,2,2,0,2,0,2,2
22,Probability,PS3,Last 2 sixes,0,0,0,0,2,0,0,2
23,Probability,PS4,10 to win,4,0,0,0,0,4,0,4

In [194]:
listProb=df_Prob.sum()
listProb[3:]

ST1    4
ST2    2
ST3    4
ST4    2
ST5    4
ST6    6
ST7    4
ST8    8
dtype: object

In [195]:
df_Python=Group_Name.get_group('Python')
df_Python

      Name Unnamed: 1      Unnamed: 2  ST1  ST2  ST3  ST4  ST5  ST6  ST7  ST8
1   Python        Q01      Arithmetic    2    2    2    2    2    2    0    2
2   Python        Q02         Strings    0    0    2    0    2    0    0    0
3   Python        Q03         Strings    2    0    2    2    0    2    2    0
4   Python        Q04  Lists, Strings    0    4    4    0    0    0    4    0
5   Python        Q05         Strings    2    2    2    0    2    0    2    2
6   Python        Q06   Comprehension    0    4    4    4    4    2    0    4
7   Python        Q07  Lists, Strings    0    0    0    0    0    0    0    0
8   Python        Q08         Strings    2    0    0    2    2    0    0    2
9   Python        Q09         Modules    2    0    0    2    2    2    2    2
10  Python        Q10           Lists    2    2    2    2    0    0    2    0
11  Python        Q11           Loops    2    0    2    2    2    2    2    0
12  Python        Q12           Loops    2    2    2    2    0    2    2    0
13  Python        Q13           Loops    0    0    0    0    4    0    0    0
14  Python        Q14           Loops    2    0    0    2    2    2    0    0
15  Python        Q15           Loops    0    0    2    0    2    0    2    0

In [196]:
listpython=df_Python.sum()
listpython[3:]

ST1    18
ST2    16
ST3    24
ST4    20
ST5    24
ST6    14
ST7    18
ST8    12
dtype: object

In [197]:
#https://www.geeksforgeeks.org/change-data-type-for-one-or-more-columns-in-pandas-dataframe/

In [205]:
new_group=Group_Name.sum()
new_group

             ST1  ST2  ST3  ST4  ST5  ST6  ST7  ST8
Name
Lin Algebra    0    0    8    6    6    4    8    6
Probability    4    2    4    2    4    6    4    8
Python        18   16   24   20   24   14   18   12
Statistics     8    2    8    6    6    6    8    8

In [207]:
info_cols =new_group.columns
info_cols

Index(['ST1', 'ST2', 'ST3', 'ST4', 'ST5', 'ST6', 'ST7', 'ST8'], dtype='object')

In [208]:
Sumlist=[new_group[num].sum() for num in new_group.columns ]
Sumlist

[30, 20, 44, 34, 40, 30, 38, 34]

In [209]:
new_group.loc["Lin Algebra"] = listLinear[3:]

In [210]:
new_group.loc["Probability"] = listProb[3:]

In [211]:
new_group.loc["Python"] = listpython[3:]

In [212]:
new_group.loc["Statistics"] = listStat[3:]

In [213]:
new_group.loc["Total"] = Sumlist

In [214]:
new_group

             ST1  ST2  ST3  ST4  ST5  ST6  ST7  ST8
Name
Lin Algebra    0    0    8    6    6    4    8    6
Probability    4    2    4    2    4    6    4    8
Python        18   16   24   20   24   14   18   12
Statistics     8    2    8    6    6    6    8    8
Total         30   20   44   34   40   30   38   34

In [215]:
new_group.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Lin Algebra to Total
Data columns (total 8 columns):
ST1    5 non-null int64
ST2    5 non-null int64
ST3    5 non-null int64
ST4    5 non-null int64
ST5    5 non-null int64
ST6    5 non-null int64
ST7    5 non-null int64
ST8    5 non-null int64
dtypes: int64(8)
memory usage: 360.0+ bytes

In [216]:
new_group['Percent']=[0,0,0,0,0]
new_group

             ST1  ST2  ST3  ST4  ST5  ST6  ST7  ST8  Percent
Name
Lin Algebra    0    0    8    6    6    4    8    6        0
Probability    4    2    4    2    4    6    4    8        0
Python        18   16   24   20   24   14   18   12        0
Statistics     8    2    8    6    6    6    8    8        0
Total         30   20   44   34   40   30   38   34        0

In [217]:
pivotdf= new_group.pivot(index='Name',columns='Percent')

KeyError: "None of ['Name'] are in the columns"

In [ ]:
#new_group.loc["Percentage"] = Percentlist

In [123]:
df_Python.head()

     Name Unnamed: 1      Unnamed: 2  ST1  ST2  ST3  ST4  ST5  ST6  ST7  ST8
1  Python        Q01      Arithmetic    2    2    2    2    2    2    0    2
2  Python        Q02         Strings    0    0    2    0    2    0    0    0
3  Python        Q03         Strings    2    0    2    2    0    2    2    0
4  Python        Q04  Lists, Strings    0    4    4    0    0    0    4    0
5  Python        Q05         Strings    2    2    2    0    2    0    2    2

In [129]:
cols=df_Python.columns[[0, 2, 3]].tolist()

In [131]:
passlist = df_Python[df_Python['ST1'] > 0]
pythonpass=passlist[cols]
pythonpass

      Name  Unnamed: 2  ST1
1   Python  Arithmetic    2
3   Python     Strings    2
5   Python     Strings    2
8   Python     Strings    2
9   Python     Modules    2
10  Python       Lists    2
11  Python       Loops    2
12  Python       Loops    2
14  Python       Loops    2

In [132]:
faillist = df_Python[df_Python['ST1'] == 0]
pythonfail=faillist[cols]
pythonfail

      Name      Unnamed: 2  ST1
2   Python         Strings    0
4   Python  Lists, Strings    0
6   Python   Comprehension    0
7   Python  Lists, Strings    0
13  Python           Loops    0
15  Python           Loops    0

In [139]:
df_linear

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
24,Lin Algebra,LS1,Age,0,0,2,0,0,2,2,0
25,Lin Algebra,LS2,Sim Equations,0,0,2,0,2,0,2,2
26,Lin Algebra,LS3,Sim Equations,0,0,4,4,4,0,4,4
27,Lin Algebra,LS4,Age,0,0,0,2,0,2,0,0

In [140]:
passlist = df_linear[df_linear['ST1'] > 0]
linearpass=passlist[cols]
linearpass

Empty DataFrame
Columns: [Name, Unnamed: 2, ST1]
Index: []

In [141]:
faillist = df_linear[df_linear['ST1'] == 0]
linearfail=faillist[cols]
linearfail

           Name     Unnamed: 2  ST1
24  Lin Algebra            Age    0
25  Lin Algebra  Sim Equations    0
26  Lin Algebra  Sim Equations    0
27  Lin Algebra            Age    0

In [136]:
df_Stat

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
16,Statistics,QS1,Mode,2,0,2,0,0,2,2,0
17,Statistics,QS2,Median,0,2,2,0,0,0,2,2
18,Statistics,QS3,"Mode, Median",4,0,4,4,4,4,4,4
19,Statistics,QS4,Mode,2,0,0,2,2,0,0,2

In [137]:
passlist = df_Stat[df_Stat['ST1'] > 0]
statpass=passlist[cols]
statpass

          Name    Unnamed: 2  ST1
16  Statistics          Mode    2
18  Statistics  Mode, Median    4
19  Statistics          Mode    2

In [138]:
faillist = df_Stat[df_Stat['ST1'] == 0]
statfail=faillist[cols]
statfail

          Name Unnamed: 2  ST1
17  Statistics     Median    0

In [133]:
df_Prob

,Name,Unnamed: 1,Unnamed: 2,ST1,ST2,ST3,ST4,ST5,ST6,ST7,ST8
20,Probability,PS1,Height,0,0,2,2,0,2,2,0
21,Probability,PS2,Bowlers,0,2,2,0,2,0,2,2
22,Probability,PS3,Last 2 sixes,0,0,0,0,2,0,0,2
23,Probability,PS4,10 to win,4,0,0,0,0,4,0,4

In [134]:
passlist = df_Prob[df_Prob['ST1'] > 0]
probpass=passlist[cols]
probpass

           Name Unnamed: 2  ST1
23  Probability  10 to win    4

In [135]:
faillist = df_Prob[df_Prob['ST1'] == 0]
probfail=faillist[cols]
probfail

           Name    Unnamed: 2  ST1
20  Probability        Height    0
21  Probability       Bowlers    0
22  Probability  Last 2 sixes    0

In [144]:
dfpass= pd.concat([pythonpass,linearpass,statpass,probpass],ignore_index=True)

In [145]:
dfpass

           Name    Unnamed: 2  ST1
0        Python    Arithmetic    2
1        Python       Strings    2
2        Python       Strings    2
3        Python       Strings    2
4        Python       Modules    2
5        Python         Lists    2
6        Python         Loops    2
7        Python         Loops    2
8        Python         Loops    2
9    Statistics          Mode    2
10   Statistics  Mode, Median    4
11   Statistics          Mode    2
12  Probability     10 to win    4

In [146]:
dffail=pd.concat([pythonfail,linearfail,statfail,probfail],ignore_index=True)

In [147]:
dffail

           Name      Unnamed: 2  ST1
0        Python         Strings    0
1        Python  Lists, Strings    0
2        Python   Comprehension    0
3        Python  Lists, Strings    0
4        Python           Loops    0
5        Python           Loops    0
6   Lin Algebra             Age    0
7   Lin Algebra   Sim Equations    0
8   Lin Algebra   Sim Equations    0
9   Lin Algebra             Age    0
10   Statistics          Median    0
11  Probability          Height    0
12  Probability         Bowlers    0
13  Probability    Last 2 sixes    0